# vsoStateGetObjChng

## Description
```pascal
FUNCTION vsoStateGetObjChng(
				hObj            : HANDLE;
				VAR outChangeID : LONGINT) : BOOLEAN;
```

```python

def vs.vsoStateGetObjChng(hObj):
    return (BOOLEAN, outChangeID)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|outChangeID|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events